#ifndef __CH_MOLE_CUCKOO_H__
#define __CH_MOLE_CUCKOO_H__
#include "common.h"
#include "su/mole.h"
typedef struct {
	u32 unk0; //0x0
	u32 unk1; //0x4
	u32 unk2; //0x8
	u32* unk3; //func_80800090
	u32 unk4; //0x10
	u32* unk5; //8010A730
	u32 unk6; //0x18
	u32 unk7; //0x1C
	u32 unk8; //0x20
	u32 unk9; //0x24
	u32 unk10; //0x28
	u32 unk11; //0x2C
	u32 unk12; //0x30
	u32* unk13; //func_80800024
	u32* unk14; //80107C2C
	u32 unk15; //0x3C
	u32 unk16; //func_80800000
	u32 unk17; //0x44
	u32 unk18; //0x48

} D_808000D0;


#endif 